/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   exit.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sgo <sgo@student.42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/28 16:54:23 by sgo               #+#    #+#             */
/*   Updated: 2023/10/29 17:05:41 by sgo              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "builtin.h"

void	ft_exit(t_cmd *cmd, t_info *info, t_envp *envp)
{
	//free 함수들 사용할 예정
	(void)cmd;
	(void)envp;
	write(STDOUT_FILENO, "exit\n", 5);
	exit(info->status);
}